fix: branding, security issue on KMIP import when replace_existing is… (#735)
* fix: branding, security issue on KMIP import when replace_existing is true + add docs on OpenSSL override

* fix: ci

* fix: update Nix hashes

* feat: add KMS server version on startup logs

* docs: reorganize README.md

* fix: GHSA-mw96

* fix: update Nix hashes
